<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Finds latest Excel installer, and downloads the pkg.
Set VERSION to a specific version number to download that version instead.
Set CULTURE_CODE to a different value to get a different localization. See
http://msdn.microsoft.com/en-us/library/ee825488(v=cs.20).aspx for a table of Culture Codes.</string>
    <key>Identifier</key>
    <string>com.github.theappletech.pkg.msword2016</string>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Microsoft Word 2016</string>
        <key>VERSION</key>
        <string>latest</string>
        <key>CULTURE_CODE</key>
        <string>0409</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MSOffice2016URLandUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>product</key>
                <string>Word</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%_Update.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
          <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%_Update.pkg/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
                <dict>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%_Update.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%_Update-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
    </array>
</dict>
</plist>